# SET

Set key to hold the string value. If key already holds a value, it is overwritten, regardless of its type. Any previous time to live associated with the key is discarded on successful SET operation.

## Syntax

```bash
SET key value [EX seconds] [PX milliseconds]
```

## Options

The SET command supports a set of options that modify its behavior:

- `EX seconds` : Set the specified expire time, in seconds (a positive integer).
- `PX milliseconds` : Set the specified expire time, in milliseconds (a positive integer).


## Examples

```bash
redis> SET mykey "Hello"
OK
redis> GET mykey
"Hello"
redis> SET mykey "World" EX 10
OK
redis> TTL mykey
(integer) 10
```